# **Column Wise Operations in Data Frame:**


1.   Getting Column Index/Label
2.   Changing Column Labels
3.   Selecting Columns
4.   Adding New Columns to Data Frame
5.   Swapping the Columns
6.   Dropping / Deleting Columns
7.   Vectorized Arithmetic Operations on Columns
8.   Applying Numpy Math Functions to a Column
9.   Setting Column Values Based on Criteria
10.  Data Type Conversions of a Column
11.  Statistical Function and Math Functions on Columns
12.  Finding Index Labels for min/max values
13.  Special Methods

In [1]:
import pandas as pd
import numpy as np

In [32]:
df = pd.read_csv('CREATE_YOUR_DATA (Responses) - Form Responses 1.csv')
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Timestamp               31 non-null     object
 1   NAME                    31 non-null     object
 2   BATCH NUMBER            31 non-null     int64
 3   HOMETOWN                31 non-null     object
 4   HIGHEST QUALIFICATION   31 non-null     object
 5   FIELD OF STUDY          31 non-null     object
 6   COURSE REGISTERED       31 non-null     object
 7   IT EXPERIENCE           31 non-null     int64
 8   SALARY EXPECTATIONS     31 non-null     object
dtypes: int64(2), object(7)
memory usage: 2.3+ KB

In [9]:
df.columns

Index(['Timestamp', 'NAME', 'BATCH NUMBER ', 'HOMETOWN',
       'HIGHEST QUALIFICATION ', 'FIELD OF STUDY', 'COURSE REGISTERED',
       'IT EXPERIENCE', 'SALARY EXPECTATIONS '],
      dtype='object')

In [10]:
df.columns.to_list()

['Timestamp',
 'NAME',
 'BATCH NUMBER ',
 'HOMETOWN',
 'HIGHEST QUALIFICATION ',
 'FIELD OF STUDY',
 'COURSE REGISTERED',
 'IT EXPERIENCE',
 'SALARY EXPECTATIONS ']

In [11]:
cols = [col.strip().lower().replace(' ','_').replace('-','_') for col in df.columns]

In [12]:
df.columns = cols

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   timestamp              31 non-null     object
 1   name                   31 non-null     object
 2   batch_number           31 non-null     int64
 3   hometown               31 non-null     object
 4   highest_qualification  31 non-null     object
 5   field_of_study         31 non-null     object
 6   course_registered      31 non-null     object
 7   it_experience          31 non-null     int64
 8   salary_expectations    31 non-null     object
dtypes: int64(2), object(7)
memory usage: 2.3+ KB

In [15]:
for i in df:
    print("*"*10,i,"*"*10)
    print(df[i].unique())

********** timestamp **********
['6/27/2025 9:03:07' '6/27/2025 9:03:25' '6/27/2025 9:03:32'
 '6/27/2025 9:03:45' '6/27/2025 9:03:50' '6/27/2025 9:04:10'
 '6/27/2025 9:04:47' '6/27/2025 9:05:20' '6/27/2025 9:05:44'
 '6/27/2025 9:05:46' '6/27/2025 9:05:50' '6/27/2025 9:06:07'
 '6/27/2025 9:06:29' '6/27/2025 9:06:31' '6/27/2025 9:06:44'
 '6/27/2025 9:06:59' '6/27/2025 9:07:28' '6/27/2025 9:07:40'
 '6/27/2025 9:07:56' '6/27/2025 9:08:04' '6/27/2025 9:08:15'
 '6/27/2025 9:08:19' '6/27/2025 9:08:50' '6/27/2025 9:09:02'
 '6/27/2025 9:09:25' '6/27/2025 9:09:56' '6/27/2025 9:10:01'
 '6/27/2025 9:10:08' '6/27/2025 9:10:30' '6/27/2025 9:10:45'
 '6/27/2025 9:11:03']
********** name **********
['Ashruth' 'Chithari Ravi' 'Ajay Erumalla ' 'Rushikanth ' 'VAMPU MANAS'
 'D SAI SHREYAS ' 'Chelikani Harshini' 'Yedeedya Injeti'
 'venkatesh nalagarla' 'Chiluka Suvarna' 'Reddymasu Teja'
 'KARLAPATI VENKATA JAYAVARDHAN' 'vishnu Durga doddipatla' 'Priya Dakhore'
 'M.Abhilash Naik ' 'mayank kumar singh' 'MANDE UDAY SHANKAR'
 'Akurala Harshitha' 'Kattela Harshitha' 'Naga Srinu Kala'
 'MANTRI VAMSHI KRISHNA' 'Nishith T' 'SAI SHREYAS D' 'k uday kiran'
 'ETYALA MAHESH ' 'Nagineni Tejaswini' 'Sravani Errolla' 'sai'
 'Mahesh kuamar' 'JETTI PRANITHA ']
********** batch_number **********
[396 397]
********** hometown **********
['Kamareddy' 'Hyderabad' 'Siddipet ' 'Vijayawada ' 'BHONGIR' 'HYDERABAD'
 'Amalapuram' 'nellore' 'Andhra pradesh,Prakasam(dist),Darsi' 'MADHIRA'
 'kakinada' 'Amravati,Maharashtra' 'Narasaraopeta ' 'kirandul'
 'RAMAYAPATNAM IN AP' 'Hanamkonda ' 'Sangareddy' 'Rajamundry' 'HYDERABAD '
 'Warangal' 'Karimnagar ' 'Rajampet,Annamayya district,Andhra Pradesh'
 'mupkal, nizamabad' 'Hyderabad ' 'Guntur' 'Kodad']
********** highest_qualification **********
['Under graduate' 'Btech' 'B.Tech' 'Btech ' 'BTECH' 'B.TECH' 'BTech' 'MCA'
 'B-Tech' 'DEGREE' 'B.tech' 'Bachelors Degree' 'BTech '
 'b.com in buisness analytics' 'B.sc' 'MBA' 'bsc(meiot)'
 'bachelor of degree' 'b.tech']
********** field_of_study **********
['Computer science engineering' 'Computer Science'
 'Computer Science and Engineering ' 'ECE' 'INFORMATION TECHNOLOGY'
 'Computer Science and Engineering' 'CSE' 'computer science'
 'computer science & engineering' 'BA.PROGRAMME' 'Information Technology'
 'EEE' 'commerce' 'DATA SCIENCE' 'Data Science '
 'Computer Science and Data Science' 'B.sc Computer science '
 'MBA Finance' 'COMPUTER SCIENCE AND ENGINEERING '
 'INFORMATION TECHNOLOGY ' 'no' 'Mining '
 'Computer Science and Artificial Intelligence' 'information technology '
 'Computer Science and DataScience ']
********** course_registered **********
['Data Science']
********** it_experience **********
[0 6 1 4 2]
********** salary_expectations **********
['4-6' 'As per the market standards' '5 - 6 LPA' '4 lpa' '5 LPA' '6 LPA'
 '5LPA' '5-6 ' '5-6 lpa' '6 lpa' '8 LPA' '5 lpa' '7lpa' '5 to 6 LPA'
 '5-8lpa' '5-6 LPA' '6 lakhs' '2500000' '10-12' '44 LPA' '5lp' '5-6lpa'
 '10 LPA Basic' '25 lpa' '10LPA']

# inconsistencies 
-
characters
spaces
text

# **1. Getting Column Index/Label:**

            (a) idx = df.columns         # get col index
            (b) label = df.columns[0]    # first col label
            (c) l = df.columns.tolist()  # list of col labels
            (d) a = df.columns.values    # array of col labels

In [ ]:
# Code Here

In [16]:
df.columns[0]

'timestamp'

In [17]:
df.columns[-1]

'salary_expectations'

In [19]:
df.columns[:3]

Index(['timestamp', 'name', 'batch_number'], dtype='object')

In [20]:
df.columns.to_list()

['timestamp',
 'name',
 'batch_number',
 'hometown',
 'highest_qualification',
 'field_of_study',
 'course_registered',
 'it_experience',
 'salary_expectations']

In [21]:
df.columns.values

array(['timestamp', 'name', 'batch_number', 'hometown',
       'highest_qualification', 'field_of_study', 'course_registered',
       'it_experience', 'salary_expectations'], dtype=object)

# **2. Changing Column Labels:**

            (a) df = df.rename(columns={'old':'new','a':'1'})
            (b) df.columns = ['new1', 'new2', 'new3']           # etc.

In [25]:
# Code Here
df = df.rename(columns={'name':'full_name'})

In [24]:
df.head()

,timestamp,name,batch_number,hometown,highest_qualification,field_of_study,course_registered,it_experience,salary_expectations
0,6/27/2025 9:03:07,Ashruth,396,Kamareddy,Under graduate,Computer science engineering,Data Science,0,4-6
1,6/27/2025 9:03:25,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards
2,6/27/2025 9:03:32,Ajay Erumalla,397,Siddipet,B.Tech,Computer Science and Engineering,Data Science,0,5 - 6 LPA
3,6/27/2025 9:03:45,Rushikanth,396,Vijayawada,Btech,ECE,Data Science,0,4 lpa
4,6/27/2025 9:03:50,VAMPU MANAS,397,BHONGIR,BTECH,ECE,Data Science,0,5 LPA

In [37]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 9 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   Timestamp               31 non-null     object
 1   NAME                    31 non-null     object
 2   BATCH NUMBER            31 non-null     int64
 3   HOMETOWN                31 non-null     object
 4   HIGHEST QUALIFICATION   31 non-null     object
 5   FIELD OF STUDY          31 non-null     object
 6   COURSE REGISTERED       31 non-null     object
 7   IT EXPERIENCE           31 non-null     int64
 8   SALARY EXPECTATIONS     31 non-null     object
dtypes: int64(2), object(7)
memory usage: 2.3+ KB

AttributeError: 'NoneType' object has no attribute 'info'

# **3. Selecting Columns:**

              (a) s = df['colName'] # select col to Series
              (b) df = df[['colName']] # select col to df
              (c) df = df[['a','b']] # select 2-plus cols
              (d) df = df[['c','a','b']] # change col order
              (e) s = df[df.columns[0]] # select by number
              (f) df = df[df.columns[[0, 3, 4]]] # by numbers
              (g) df = [df.columns[:-1]] # all but last col
              (h) s = df.a # same as s = df['a']
              (i) df.existing_column = df.a / df.b
              (j) df['new_column'] = df.a / df.b

In [34]:
# Code Here
df['NAME']       # series

0                           Ashruth
1                     Chithari Ravi
2                    Ajay Erumalla
3                       Rushikanth
4                       VAMPU MANAS
5                    D SAI SHREYAS
6                Chelikani Harshini
7                   Yedeedya Injeti
8               venkatesh nalagarla
9                   Chiluka Suvarna
10                   Reddymasu Teja
11    KARLAPATI VENKATA JAYAVARDHAN
12          vishnu Durga doddipatla
13                    Priya Dakhore
14                 M.Abhilash Naik
15               mayank kumar singh
16               Chelikani Harshini
17               MANDE UDAY SHANKAR
18                Akurala Harshitha
19                Kattela Harshitha
20                  Naga Srinu Kala
21            MANTRI VAMSHI KRISHNA
22                        Nishith T
23                    SAI SHREYAS D
24                     k uday kiran
25                   ETYALA MAHESH
26               Nagineni Tejaswini
27                  Sravani Errolla
28                              sai
29                    Mahesh kuamar
30                  JETTI PRANITHA
Name: NAME, dtype: object

In [36]:
df[['NAME']].head()

             NAME
0         Ashruth
1   Chithari Ravi
2  Ajay Erumalla
3     Rushikanth
4     VAMPU MANAS

In [39]:
df[['NAME','BATCH NUMBER ']].head()

             NAME  BATCH NUMBER
0         Ashruth            396
1   Chithari Ravi            397
2  Ajay Erumalla             397
3     Rushikanth             396
4     VAMPU MANAS            397

In [43]:
df[df.columns[0]].head()

0    6/27/2025 9:03:07
1    6/27/2025 9:03:25
2    6/27/2025 9:03:32
3    6/27/2025 9:03:45
4    6/27/2025 9:03:50
Name: Timestamp, dtype: object

In [44]:
df[[df.columns[0]]].head()

           Timestamp
0  6/27/2025 9:03:07
1  6/27/2025 9:03:25
2  6/27/2025 9:03:32
3  6/27/2025 9:03:45
4  6/27/2025 9:03:50

In [53]:
df[df.columns[[0, 3, 4]]].head()  # selected index

           Timestamp     HOMETOWN HIGHEST QUALIFICATION
0  6/27/2025 9:03:07    Kamareddy         Under graduate
1  6/27/2025 9:03:25    Hyderabad                  Btech
2  6/27/2025 9:03:32    Siddipet                  B.Tech
3  6/27/2025 9:03:45  Vijayawada                  Btech
4  6/27/2025 9:03:50      BHONGIR                  BTECH

In [48]:
df[df.columns[0:3]].head()

           Timestamp            NAME  BATCH NUMBER
0  6/27/2025 9:03:07         Ashruth            396
1  6/27/2025 9:03:25   Chithari Ravi            397
2  6/27/2025 9:03:32  Ajay Erumalla             397
3  6/27/2025 9:03:45     Rushikanth             396
4  6/27/2025 9:03:50     VAMPU MANAS            397

In [56]:
df.columns[0]

'Timestamp'

In [57]:
df.NAME

0                           Ashruth
1                     Chithari Ravi
2                    Ajay Erumalla
3                       Rushikanth
4                       VAMPU MANAS
5                    D SAI SHREYAS
6                Chelikani Harshini
7                   Yedeedya Injeti
8               venkatesh nalagarla
9                   Chiluka Suvarna
10                   Reddymasu Teja
11    KARLAPATI VENKATA JAYAVARDHAN
12          vishnu Durga doddipatla
13                    Priya Dakhore
14                 M.Abhilash Naik
15               mayank kumar singh
16               Chelikani Harshini
17               MANDE UDAY SHANKAR
18                Akurala Harshitha
19                Kattela Harshitha
20                  Naga Srinu Kala
21            MANTRI VAMSHI KRISHNA
22                        Nishith T
23                    SAI SHREYAS D
24                     k uday kiran
25                   ETYALA MAHESH
26               Nagineni Tejaswini
27                  Sravani Errolla
28                              sai
29                    Mahesh kuamar
30                  JETTI PRANITHA
Name: NAME, dtype: object

# **4. Adding New Column to a Data Frame:**

              (a) df['new_col'] = range(len(df))
              (b) df['new_col'] = np.repeat(np.nan,len(df))
              (c) df['random'] = np.random.rand(len(df))
              (d) df['index_as_col'] = df.index
              (e) df1[['b','c']] = df2[['e','f']]

In [41]:
# Code Here

'Timestamp'

In [58]:
df['Index'] = range(len(df))

In [60]:
df.head(2)

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS,Index
0,6/27/2025 9:03:07,Ashruth,396,Kamareddy,Under graduate,Computer science engineering,Data Science,0,4-6,0
1,6/27/2025 9:03:25,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards,1

In [61]:
df['a_column'] = np.repeat('a',len(df))

In [62]:
df.head(3)

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS,Index,a_column
0,6/27/2025 9:03:07,Ashruth,396,Kamareddy,Under graduate,Computer science engineering,Data Science,0,4-6,0,a
1,6/27/2025 9:03:25,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards,1,a
2,6/27/2025 9:03:32,Ajay Erumalla,397,Siddipet,B.Tech,Computer Science and Engineering,Data Science,0,5 - 6 LPA,2,a

In [64]:
df['random_numbers'] = np.random.rand(len(df))

In [65]:
df

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS,Index,a_column,random_numbers
0,6/27/2025 9:03:07,Ashruth,396,Kamareddy,Under graduate,Computer science engineering,Data Science,0,4-6,0,a,0.583839
1,6/27/2025 9:03:25,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards,1,a,0.847088
2,6/27/2025 9:03:32,Ajay Erumalla,397,Siddipet,B.Tech,Computer Science and Engineering,Data Science,0,5 - 6 LPA,2,a,0.831210
3,6/27/2025 9:03:45,Rushikanth,396,Vijayawada,Btech,ECE,Data Science,0,4 lpa,3,a,0.847653
4,6/27/2025 9:03:50,VAMPU MANAS,397,BHONGIR,BTECH,ECE,Data Science,0,5 LPA,4,a,0.209994
5,6/27/2025 9:04:10,D SAI SHREYAS,396,HYDERABAD,B.TECH,INFORMATION TECHNOLOGY,Data Science,0,6 LPA,5,a,0.930967
6,6/27/2025 9:04:47,Chelikani Harshini,397,Hyderabad,BTech,Computer Science and Engineering,Data Science,0,5LPA,6,a,0.252827
7,6/27/2025 9:05:20,Yedeedya Injeti,397,Amalapuram,B.Tech,CSE,Data Science,0,5-6,7,a,0.891848
8,6/27/2025 9:05:44,venkatesh nalagarla,397,nellore,MCA,computer science,Data Science,0,5-6 lpa,8,a,0.313811
9,6/27/2025 9:05:46,Chiluka Suvarna,396,Hyderabad,B.Tech,computer science & engineering,Data Science,0,6 lpa,9,a,0.375885
10,6/27/2025 9:05:50,Reddymasu Teja,396,"Andhra pradesh,Prakasam(dist),Darsi",B-Tech,CSE,Data Science,0,8 LPA,10,a,0.274614
11,6/27/2025 9:06:07,KARLAPATI VENKATA JAYAVARDHAN,396,MADHIRA,DEGREE,BA.PROGRAMME,Data Science,0,8 LPA,11,a,0.333890
12,6/27/2025 9:06:29,vishnu Durga doddipatla,396,kakinada,B.tech,Computer Science,Data Science,0,5 lpa,12,a,0.020107
13,6/27/2025 9:06:31,Priya Dakhore,397,"Amravati,Maharashtra",Bachelors Degree,Information Technology,Data Science,1,7lpa,13,a,0.953514
14,6/27/2025 9:06:44,M.Abhilash Naik,397,Narasaraopeta,BTech,EEE,Data Science,0,5 to 6 LPA,14,a,0.327317
15,6/27/2025 9:06:59,mayank kumar singh,397,kirandul,b.com in buisness analytics,commerce,Data Science,0,5-8lpa,15,a,0.472960
16,6/27/2025 9:07:28,Chelikani Harshini,397,Hyderabad,BTech,Computer Science and Engineering,Data Science,0,5LPA,16,a,0.404664
17,6/27/2025 9:07:40,MANDE UDAY SHANKAR,396,RAMAYAPATNAM IN AP,B.TECH,DATA SCIENCE,Data Science,0,8 LPA,17,a,0.232075
18,6/27/2025 9:07:56,Akurala Harshitha,397,Hanamkonda,B.Tech,Data Science,Data Science,0,5-6 LPA,18,a,0.857832
19,6/27/2025 9:08:04,Kattela Harshitha,397,Sangareddy,BTech,Computer Science and Data Science,Data Science,0,6 lakhs,19,a,0.890738
20,6/27/2025 9:08:15,Naga Srinu Kala,396,Rajamundry,B.sc,B.sc Computer science,Data Science,0,5 - 6 LPA,20,a,0.011407
21,6/27/2025 9:08:19,MANTRI VAMSHI KRISHNA,396,HYDERABAD,MBA,MBA Finance,Data Science,4,2500000,21,a,0.919130
22,6/27/2025 9:08:50,Nishith T,396,Warangal,BTECH,COMPUTER SCIENCE AND ENGINEERING,Data Science,0,10-12,22,a,0.533938
23,6/27/2025 9:09:02,SAI SHREYAS D,396,HYDERABAD,B.TECH,INFORMATION TECHNOLOGY,Data Science,0,44 LPA,23,a,0.474116
24,6/27/2025 9:09:25,k uday kiran,396,kakinada,bsc(meiot),no,Data Science,0,5lp,24,a,0.511935
25,6/27/2025 9:09:56,ETYALA MAHESH,396,Karimnagar,B.tech,Mining,Data Science,0,6 lpa,25,a,0.274805
26,6/27/2025 9:10:01,Nagineni Tejaswini,397,"Rajampet,Annamayya district,Andhra Pradesh",B.Tech,Computer Science and Artificial Intelligence,Data Science,0,5-6lpa,26,a,0.371897
27,6/27/2025 9:10:08,Sravani Errolla,396,"mupkal, nizamabad",bachelor of degree,computer science,Data Science,0,10 LPA Basic,27,a,0.684938
28,6/27/2025 9:10:30,sai,396,Hyderabad,b.tech,information technology,Data Science,0,25 lpa,28,a,0.763665
29,6/27/2025 9:10:45,Mahesh kuamar,396,Guntur,Btech,CSE,Data Science,2,10LPA,29,a,0.664788
30,6/27/2025 9:11:03,JETTI PRANITHA,397,Kodad,B.Tech,Computer Science and DataScience,Data Science,0,6 LPA,30,a,0.709939

# **6. Dropping or Deleting Columns:**

            
              (a) df = df.drop('col1', axis=1)
              (b) df.drop('col1', axis=1, inplace=True)
              (c) df = df.drop(['col1','col2'], axis=1)
              (c) s = df.pop('col') # drops from frame
              (d) del df['col'] # even classic python works
              (e) df = df.drop(df.columns[0], axis=1)#first
              (f) df = df.drop(df.columns[-1:],axis=1)#last

In [67]:
# code here
df.pop('Index')

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
20    20
21    21
22    22
23    23
24    24
25    25
26    26
27    27
28    28
29    29
30    30
Name: Index, dtype: int64

In [71]:
df.drop('random_numbers',axis=1,inplace=True)

In [73]:
df.head(2)

,Timestamp,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS,a_column
0,6/27/2025 9:03:07,Ashruth,396,Kamareddy,Under graduate,Computer science engineering,Data Science,0,4-6,a
1,6/27/2025 9:03:25,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards,a

In [74]:
df.drop(['a_column','Timestamp'],axis=1,inplace=True)

In [75]:
df.head(2)

,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS
0,Ashruth,396,Kamareddy,Under graduate,Computer science engineering,Data Science,0,4-6
1,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards

In [76]:
df.columns

Index(['NAME', 'BATCH NUMBER ', 'HOMETOWN', 'HIGHEST QUALIFICATION ',
       'FIELD OF STUDY', 'COURSE REGISTERED', 'IT EXPERIENCE',
       'SALARY EXPECTATIONS '],
      dtype='object')

# **7. Vectorized Arithmetic Operations:**

              (a) df['proportion']=df['count']/df['total']
              (b) df['percent'] = df['proportion'] * 100.0

In [77]:
# code here
df['fake_exp'] = df['IT EXPERIENCE'] * 2

In [78]:
df.head(10)

,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS,fake_exp
0,Ashruth,396,Kamareddy,Under graduate,Computer science engineering,Data Science,0,4-6,0
1,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards,12
2,Ajay Erumalla,397,Siddipet,B.Tech,Computer Science and Engineering,Data Science,0,5 - 6 LPA,0
3,Rushikanth,396,Vijayawada,Btech,ECE,Data Science,0,4 lpa,0
4,VAMPU MANAS,397,BHONGIR,BTECH,ECE,Data Science,0,5 LPA,0
5,D SAI SHREYAS,396,HYDERABAD,B.TECH,INFORMATION TECHNOLOGY,Data Science,0,6 LPA,0
6,Chelikani Harshini,397,Hyderabad,BTech,Computer Science and Engineering,Data Science,0,5LPA,0
7,Yedeedya Injeti,397,Amalapuram,B.Tech,CSE,Data Science,0,5-6,0
8,venkatesh nalagarla,397,nellore,MCA,computer science,Data Science,0,5-6 lpa,0
9,Chiluka Suvarna,396,Hyderabad,B.Tech,computer science & engineering,Data Science,0,6 lpa,0

# **8. Apply Numpy Math Functions:**

              (a) df['log_data'] = np.log(df['col1'])

# syntax
df['new_col_name'] = operation(df['old_col_name'])

# **9. Setting Column Values Based on Criteria:**

              (a) df['b'] = df['a'].where(df['a']>0, other=0)
              (b) df['d'] = df['a'].where(df.b!=0, other=df.c)

In [79]:
# code here
df['experienced_cand'] = df['IT EXPERIENCE'].where(df['IT EXPERIENCE']>0, other = 'Not Experienced')

In [80]:
df.head(5)

,NAME,BATCH NUMBER,HOMETOWN,HIGHEST QUALIFICATION,FIELD OF STUDY,COURSE REGISTERED,IT EXPERIENCE,SALARY EXPECTATIONS,fake_exp,experienced_cand
0,Ashruth,396,Kamareddy,Under graduate,Computer science engineering,Data Science,0,4-6,0,Not Experienced
1,Chithari Ravi,397,Hyderabad,Btech,Computer Science,Data Science,6,As per the market standards,12,6
2,Ajay Erumalla,397,Siddipet,B.Tech,Computer Science and Engineering,Data Science,0,5 - 6 LPA,0,Not Experienced
3,Rushikanth,396,Vijayawada,Btech,ECE,Data Science,0,4 lpa,0,Not Experienced
4,VAMPU MANAS,397,BHONGIR,BTECH,ECE,Data Science,0,5 LPA,0,Not Experienced

# **10. DataType Conversion of a Column:**

              (a) st = df['col'].astype(str)# Series dtype
              (b) a = df['col'].values # numpy array
              (c) l = df['col'].tolist() # python list

In [84]:
df['IT EXPERIENCE']=df['IT EXPERIENCE'].astype('str')

In [85]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 31 entries, 0 to 30
Data columns (total 10 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   NAME                    31 non-null     object
 1   BATCH NUMBER            31 non-null     int64
 2   HOMETOWN                31 non-null     object
 3   HIGHEST QUALIFICATION   31 non-null     object
 4   FIELD OF STUDY          31 non-null     object
 5   COURSE REGISTERED       31 non-null     object
 6   IT EXPERIENCE           31 non-null     object
 7   SALARY EXPECTATIONS     31 non-null     object
 8   fake_exp                31 non-null     int64
 9   experienced_cand        31 non-null     object
dtypes: int64(2), object(8)
memory usage: 2.6+ KB

# **11. Statistical and Math Functions:**

              (a) value = df['col'].dtype # type of data
              (b) value = df['col'].size # col dimensions
              (c) value = df['col'].count() # non-NA count
              (d) value = df['col'].sum()
              (e) value = df['col'].prod()
              (f) value = df['col'].min()
              (g) value = df['col'].max()
              (h) value = df['col'].mean() # also median()
              (i) value = df['col'].cov(df['col2'])
              (j) s = df['col'].describe()
              (k) s = df['col'].value_counts()



              s = df['col'].isnull()
              s = df['col'].notnull() # not isnull()
              s = df['col'].astype(float)
              s = df['col'].abs()
              s = df['col'].round(decimals=0)
              s = df['col'].diff()
              s = df['col'].fillna(0) # replace NaN w 0

In [ ]:
# code here

# **12. Find Index Labels for min/max:**

               (a) label = df['col1'].idxmin()
               (b) label = df['col1'].idxmax()
               (c) df.nlargest(n,col_name)
               (d) df.nsmallest(n,col_name)

In [ ]:
# code here

13    4.3
8     4.4
38    4.4
42    4.4
41    4.5
Name: SepalLengthCm, dtype: float64

# **Working With Categorical Data Columns:**

            (a) nunique(): gives count of unique categories
            (b) unique():  gives names of unique categories
            (c) value_counts(): gives frequency(count) of all categories
            (d) mode(): gives most frequent category.

In [4]:
# code here
df['HIGHEST QUALIFICATION '].nunique()

19

In [5]:
df['HIGHEST QUALIFICATION '].unique()

array(['Under graduate', 'Btech', 'B.Tech', 'Btech ', 'BTECH', 'B.TECH',
       'BTech', 'MCA', 'B-Tech', 'DEGREE', 'B.tech', 'Bachelors Degree',
       'BTech ', 'b.com in buisness analytics', 'B.sc', 'MBA',
       'bsc(meiot)', 'bachelor of degree', 'b.tech'], dtype=object)

In [6]:
df['HIGHEST QUALIFICATION '].count()

31

In [7]:
df['HIGHEST QUALIFICATION '].mode()

0    B.Tech
Name: HIGHEST QUALIFICATION , dtype: object

In [8]:
df['HIGHEST QUALIFICATION '].value_counts()

HIGHEST QUALIFICATION
B.Tech                         6
B.TECH                         3
BTech                          3
BTECH                          2
Btech                          2
B.tech                         2
Under graduate                 1
b.com in buisness analytics    1
bachelor of degree             1
bsc(meiot)                     1
MBA                            1
B.sc                           1
DEGREE                         1
BTech                          1
Bachelors Degree               1
B-Tech                         1
MCA                            1
Btech                          1
b.tech                         1
Name: count, dtype: int64

## Filtering Rows from a DataFrame
### Way 1
We can select the rows by using slicing operation.
### Syntax df[ starting_row_index : ending_row_index : step ]

### Way 2
Similar to numpy Pandas can accept boolean indexes.
To select rows based on a conditional expression, use a condition inside the selection brackets [].
### Syntax df[ CONDITION ]